org/index.org
#+TITLE: Paul Horsfall
#+STARTUP: showall

* About

I'm a computer programmer based in Leeds in the UK. The best way to
contact me is to send an email to [[mailto:horsfallp@gmail.com][horsfallp@gmail.com]].

I'm currently available for hire. My [[file:bio.org][bio]] gives an overview of my
skills and recent experience. Please feel free to get in touch if you
have a project (of any kind!) you think I might be able to help with,
I'd be happy to chat.

* Projects

- [[https://hackaday.io/project/196636-homebrew-sdr-receiver][Homebrew SDR Receiver]]
- [[file:articles/scope.org][Sampling Scope Prototype]]
- [[https://github.com/null-a/frost][frost]] -- A simple RISC-V CPU implemented in Verilog
- [[https://github.com/null-a/ice40-breakout-pcb][iCE40 break-out PCB]] -- A development board for the Lattice iCE40 FPGA
