index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-13 Tue 13:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Paul Horsfall</title>
<meta name="author" content="Paul Horsfall" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="/css/sp.css" type="text/css" />
</head>
<body>
<div id="preamble" class="status">
<a href="/">&#10548;Home</a>
</div>
<div id="content" class="content">
<h1 class="title">Paul Horsfall</h1>

<div id="outline-container-orgbb7bef0" class="outline-2">
<h2 id="orgbb7bef0">About</h2>
<div class="outline-text-2" id="text-orgbb7bef0">
<p>
I'm a computer programmer based in Leeds in the UK. The best way to
contact me is to send an email to <a href="mailto:horsfallp@gmail.com">horsfallp@gmail.com</a>.
</p>

<p>
I'm currently available for hire. My <a href="bio.html">bio</a> gives an overview of my
skills and recent experience. Please feel free to get in touch if you
have a project (of any kind!) you think I might be able to help with,
I'd be happy to chat.
</p>
</div>
</div>

<div id="outline-container-org9768dcf" class="outline-2">
<h2 id="org9768dcf">Projects</h2>
<div class="outline-text-2" id="text-org9768dcf">
<ul class="org-ul">
<li><a href="https://hackaday.io/project/196636-homebrew-sdr-receiver">Homebrew SDR Receiver</a></li>
<li><a href="articles/scope.html">Sampling Scope Prototype</a></li>
<li><a href="https://github.com/null-a/frost">frost</a> &#x2013; A simple RISC-V CPU implemented in Verilog</li>
<li><a href="https://github.com/null-a/ice40-breakout-pcb">iCE40 break-out PCB</a> &#x2013; A development board for the Lattice iCE40 FPGA</li>
</ul>
</div>
</div>
</div>
</body>
</html>